app/Controllers/User/User.php

SELECT *
FROM `role`
WHERE `role`.`deleted_at` IS NULL
---
	public function index()
	{
		$data['params'] = array(
			'keywords' => '',
			'rows' => 10,
			'pageno' => 1,
			'sort_by' => 'id',
			'sort_order' => 'desc',
		);
		$data['users'] = $this->userModel->getUsers($data['params']);
		$roles_ext = $this->roleModel->find();