app/Controllers/pims/Documents.php

SELECT *
FROM `document_purposes`
WHERE `document_purposes`.`deleted_at` IS NULL
SELECT *
FROM `document_revisions`
WHERE `document_revisions`.`deleted_at` IS NULL
---
	public function addRevisedDocument()
	{
		$data['id'] = $this->request->getGet('id');
		$data['revision_document'] = $this->edmsDocumentsModel->getEdmsDocumentByID($data['id']);
		$data['document_purposes'] = $this->documentPurposesModel->find();
		$data['document_revisions'] = $this->documentRevisionModel->find();

INSERT INTO `edms_document_revisions` (`edms_document_id`, `document`, `document_purpose_id`, `document_revision_id`, `version_number`, `description`, `created_by`, `created_at`, `updated_at`) VALUES ('10', '1714649258_39dc8ef88c670d73b80d.doc', '7', '3', '13', 'Testing Document Revision', '1', '2024-05-02 16:57:38', '2024-05-02 16:57:38')
---
	public function updateRevisedDocument()
	{
		if($this->request->getPost(csrf_token()) === csrf_hash()) {
			$data['id'] = $this->request->getPost('edms_document_id');
			$rules = array(
				'document' => ['label' => 'Document', 'rules' => ['uploaded[document]', 'ext_in[document,pdf,png,jpg,jpeg,doc,docx]', 'max_size[document,20480]']],
				'version_number' => ['label' => 'Version Number' , 'rules' => 'required|is_unique[edms_document_revisions.version_number]'],
				'document_revision_id' => ['label' => 'Document Revision', 'rules' => 'required'],
				'document_purpose_id' => ['label' => 'Document Purpose', 'rules' => 'required'],
				'description' => ['label' => 'Description', 'rules' => 'required'],
			);
			$check = $this->validate($rules);
			if($check == TRUE) {
				$file_upload = $this->request->getFile('document');
				if($file_upload->isValid()) {
					$file_name = $file_upload->getRandomName();
					$file_upload->move(DOCUMENTROOT.'edms_docs/', $file_name);
				}
				$add_rev_doc = array(
					'edms_document_id' => $this->request->getPost('edms_document_id'),
					'document' => $file_name,
					'document_purpose_id' => $this->request->getPost('document_purpose_id'),
					'document_revision_id' => $this->request->getPost('document_revision_id'),
					'version_number' => $this->request->getPost('version_number'),
					'description' => $this->request->getPost('description'),
					'created_at' => date('Y-m-d H:i'),
					'created_by' => $this->session->get('user')['id'],
				);
				$this->edmsDocumentRevisionsModel->insert($add_rev_doc);

SELECT *
FROM `document_purposes`
WHERE `document_purposes`.`deleted_at` IS NULL
SELECT *
FROM `document_revisions`
WHERE `document_revisions`.`deleted_at` IS NULL
---
			}
			else {
				$data['revision_document'] = $this->edmsDocumentsModel->getEdmsDocumentByID($data['id']);
				$data['document_purposes'] = $this->documentPurposesModel->find();
				$data['document_revisions'] = $this->documentRevisionModel->find();

SELECT *
FROM `document_purposes`
WHERE `document_purposes`.`deleted_at` IS NULL
SELECT *
FROM `document_revisions`
WHERE `document_revisions`.`deleted_at` IS NULL
SELECT *
FROM `document_status`
WHERE `document_status`.`deleted_at` IS NULL
SELECT *
FROM `edms_document_revisions`
WHERE `edms_document_id` = '10'
AND `edms_document_revisions`.`deleted_at` IS NULL
ORDER BY `id` DESC
SELECT COUNT(*) AS `numrows`
FROM `edms_document_revisions`
WHERE `edms_document_id` = '10'
AND `edms_document_revisions`.`deleted_at` IS NULL
---
	public function viewDocument()
	{
		$id = $this->request->getGet('id');
		$purposes = $this->documentPurposesModel->find();
		foreach($purposes as $p_k => $p_val) {
			$data['document_purposes'][$p_val['id']] = $p_val;
		}
		$revisions = $this->documentRevisionModel->find();
		foreach($revisions as $r_k => $r_val) {
			$data['document_revisions'][$r_val['id']] = $r_val;
		}
		$data['edms_document'] = $this->edmsDocumentsModel->getEdmsDocumentByID($id);
		$statusus = $this->documentStatusModel->find();
		foreach($statusus as $s_k => $status_val) {
			$data['status_list'][$status_val['id']] = $status_val;
		}
		$data['rev_doc_history_status'] = $this->documentRevisionHistoryModel->where('edms_document_revision_id', $data['edms_document']['revision_id'])->orderBy('id', 'desc')->find();
		// print "<pre>";print_r($data['rev_doc_history_status']); print "</pre>";exit;
		$data['revised_documents'] = $this->edmsDocumentRevisionsModel->where('edms_document_id', $id)->orderBy('id','desc')->find();
		$data['revised_doc_total'] = $this->edmsDocumentRevisionsModel->where('edms_document_id', $id)->countAllResults();