app/Models/pims/EDMSDocumentsModel.php

	public function getEdmsDocumentByID($id) {
		$this->builder = $this->db->table('edms_document_revisions edr');
		$this->builder->select('ed.id,edr.id as revision_id,edr.document,ed.code,ed.est_start_date,ed.est_end_date,ed.start_date,ed.end_date,ed.origin,edr.version_number,edr.created_at,p.name as project_name,d.name as discipline_name,dr.name as doc_revision,dp.name as doc_purpose,dt.name as doc_type,ed.verify_status,ed.approve_status,u.name as username,u1.name as update_name,ds.code as verify_code,ds.name as verify_name,ds1.code as approved_code,ds1.name as approved_name,edr.updated_at');
		$this->builder->join('edms_documents ed', 'ed.edms_document_revision_id = edr.id', 'LEFT');
		$this->builder->join('projects p', 'p.id = ed.project_id', 'LEFT');
		$this->builder->join('disciplines d', 'd.id = ed.discipline_id', 'LEFT');
		$this->builder->join('document_types dt', 'dt.id = ed.document_type_id', 'LEFT');
		$this->builder->join('document_revisions dr', 'dr.id = edr.document_revision_id', 'LEFT');
		$this->builder->join('document_purposes dp', 'dp.id = edr.document_purpose_id', 'LEFT');
		$this->builder->join('document_status ds', 'ds.id = ed.verify_status', 'LEFT');
		$this->builder->join('document_status ds1', 'ds1.id = ed.approve_status', 'LEFT');
		$this->builder->join('user u', 'u.id = ed.created_by', 'LEFT');
		$this->builder->join('user u1', 'u1.id = ed.updated_by', 'LEFT');
		$this->builder->where('edr.edms_document_id', $id);
		$this->builder->where('ed.deleted_at', NULL);
		$this->builder->orderBy('edr.id','desc');
		$this->builder->limit(1,0);
		return $this->builder->get()->getRowArray();
---
SELECT `ed`.`id`, `edr`.`id` as `revision_id`, `edr`.`document`, `ed`.`code`, `ed`.`est_start_date`, `ed`.`est_end_date`, `ed`.`start_date`, `ed`.`end_date`, `ed`.`origin`, `edr`.`version_number`, `edr`.`created_at`, `p`.`name` as `project_name`, `d`.`name` as `discipline_name`, `dr`.`name` as `doc_revision`, `dp`.`name` as `doc_purpose`, `dt`.`name` as `doc_type`, `ed`.`verify_status`, `ed`.`approve_status`, `u`.`name` as `username`, `u1`.`name` as `update_name`, `ds`.`code` as `verify_code`, `ds`.`name` as `verify_name`, `ds1`.`code` as `approved_code`, `ds1`.`name` as `approved_name`, `edr`.`updated_at`
FROM `edms_document_revisions` `edr`
LEFT JOIN `edms_documents` `ed` ON `ed`.`edms_document_revision_id` = `edr`.`id`
LEFT JOIN `projects` `p` ON `p`.`id` = `ed`.`project_id`
LEFT JOIN `disciplines` `d` ON `d`.`id` = `ed`.`discipline_id`
LEFT JOIN `document_types` `dt` ON `dt`.`id` = `ed`.`document_type_id`
LEFT JOIN `document_revisions` `dr` ON `dr`.`id` = `edr`.`document_revision_id`
LEFT JOIN `document_purposes` `dp` ON `dp`.`id` = `edr`.`document_purpose_id`
LEFT JOIN `document_status` `ds` ON `ds`.`id` = `ed`.`verify_status`
LEFT JOIN `document_status` `ds1` ON `ds1`.`id` = `ed`.`approve_status`
LEFT JOIN `user` `u` ON `u`.`id` = `ed`.`created_by`
LEFT JOIN `user` `u1` ON `u1`.`id` = `ed`.`updated_by`
WHERE `edr`.`edms_document_id` = '10'
AND `ed`.`deleted_at` IS NULL
ORDER BY `edr`.`id` DESC
 LIMIT 1