app/Models/User/UserModel.php

	public function getUsers($params)
	{
		$builder = $this->db->table('user');
		$builder->select('*');
		if(isset($params['keywords']) and $params['keywords'] != '') {
			$builder->groupStart();
			$builder->like('name', $params['keywords']);
			$builder->orLike('username', $params['keywords']);
			$builder->orLike('user_code', $params['keywords']);
			$builder->orLike('name', $params['keywords']);
			$builder->orLike('email', $params['keywords']);
			$builder->orLike('phone', $params['keywords']);
			$builder->groupEnd();
		}
		$builder->where('deleted_at', NULL);
		$builder->orderBy($params['sort_by'],$params['sort_order']);
		$builder->limit($params['rows'],($params['pageno']-1)*$params['rows']);
		return $builder->get()->getResultArray();
---
SELECT *
FROM `user`
WHERE `deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10